{"_id":{"$oid":"100000000000000000000001"}, "name":"Roasted Carrots with Cardamom Butter", "photo":"http://assets.eatingwell.com/sites/default/files/imagecache/standard/recipes/SD6317.JPG", "ingredients":["4 ts. butter, melted", "2 ts. coconut oil", "1 ts. ground cardamom", "1/2 ts. salt", "2 lb. carrots"], "directions":["Peel carrots and cut diagonally into 1/4-in-thick slices.","Position rack in lower third of oven.  Preheat to 400 F.","Combine butter, oil, cardamom, and salt in medium bowl.","Add carrots and toss well to coat.","Spread evenly on a rimmed baking sheet.","Roast carrots, stirring twice, until tended and golden (about 30 mins).", "Serve immediately."]}
{"_id":{"$oid":"100000000000000000000002"}, "name":"Sausage, Dried Cranberry, and Apple Stuffing", "photo":"http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2006/11/21/0/ds0313_stuffing1.jpg.rend.sni12col.landscape.jpeg", "ingredients":["1 pound mild bulk breakfast sausage", "4 tablespoons butter", "3 cups sliced leeks, white and pale green parts only, cleaned well (about 2 large leeks)", "2 Granny Smith apples, cored and chopped", "1 cup chopped celery with leaves", "1 tablespoon poultry seasoning", "1 cup dried cranberries, rehydrated in boiling water for 15 minutes and drained", "1 tablespoon chopped fresh sage leaves", "2 teaspoons chopped fresh rosemary", "6 cups boxed bread cubes (croutons)", "1/3 cup chopped fresh parsley leaves", "2 to 3 cups chicken stock", "1 tablespoon salt", "2 teaspoons ground black pepper"], "directions": ["Preheat the oven to 375 degrees F.", "Sauté the sausage in a large heavy skillet over medium-high heat until cooked through, crumbling coarsely with the back of a spoon, about 10 minutes. Using a slotted spoon, transfer the sausage and drippings to a large bowl. Melt the butter in the same skillet over medium-high heat. Add the leeks, apples, celery and poultry seasoning to the skillet and sauté until the leeks are soft, about 8 minutes. Mix in the drained cranberries, sage and rosemary. Add the mixture to the sausage, then mix in the croutons and parsley. Next add the chicken stock a little at a time until the stuffing is very moist. Be sure not to overdo it; it shouldn't be mushy. Season with salt and pepper. Place in a casserole dish. (The stuffing can be made to this point 2 days before Thanksgiving, refrigerated.)", "Bake in a 14-inch oval or 9 by 13-inch rectangular casserole dish and place, uncovered, in the oven for 20 to 30 minutes, until the top is crispy and the center piping hot. Remove and serve immediately.", "*Cook\'s Note: If stuffing a turkey, the stuffing must be cold before being placed in the bird."] }
{"_id":{"$oid":"100000000000000000000003"}, "name":"Paleo Cranberry Sauce", "photo":"http://www.multiplydelicious.com/thefood/wp-content/uploads/2012/11/cranberry_sauce1.jpg","ingredients":["1 pound fresh cranberries", "1 cup orange juice","1/2 teaspoon ground cinnamon","1/4 teaspoon ground nutmeg", "1 tablespoon maple syrup" ], "directions":["Rinse cranberries and remove the bad cranberries.","Mix all of the ingredients together in a saucepan over medium-high heat.  Bring the sauce to a boil, then reduce heat to medium-low and simmer until the berries begin to break, or for about 20 minutes.","Remove from heat and let cranberry sauce sit until it reaches room temperatures. The sauce will thicken as it cools.","Note: At this time of the year, you shouldn’t have any problem finding fresh cranberries, but you can always use frozen ones in the case you can’t find any." ] }
